package com.kh.chap01.run;

public class FileRun {

	public static void main(String[] args) {

/*
 * IO => Input & Output , 입/출력
 * 
 * 프로그램 상의 데이터를 외부매체(모니터, 스피커, DB, 프로세스, 콘솔, "파일")로 출력하거나
 * 입력장치(마우스, 키보드, 마이크, "파일")로 입력받는 과정
 * 
 * IO를 진행하고 싶다면 먼저 프로그램하고 외부매체간의 "통로를 만들어야함
 * => 스트림(Stream)
 * 
 * 스트림의 특징
 * 
 *  단방향 : 입력이면 입력 : 출력이면 출력
 *  		입력용과 출력용이 각각 따로 존재함
 *  
 *  - 선입선출(First In First Out) => 시간지연 문제가 발생할 수 있음
 *  
 *  스트림의 구분
 *  
 *  - 스트림의 사이즈
 *  
 *  바이트 스트림 : 1Byte짜리 데이터가 이동할 수 있는 통로
 *  			=> 입력(XXXInputStream) / 출력(XXXOutputStream)
 *  
 *  문자 스트림 : 2Byte짜리 데이터가 이동할 수 있는 통로
 *  			=> 입력(XXXReader) / 출력(XXXWriter)
 *  
 *  - 외부매체와 직접적인 연결 여부
 *  
 *  기반 스트림 : 외부매체랑 직접적으로 연결되는 스트림
 *  
 *  보조 스트림 : 기반스트림의 성능을 향상시키기 위한 용도로 사용하는 스트림
 *  			=> 단독사용불가능(반드시 기반스트림이 존재해야함)
 *  			=> 속도 향상, 자료형에 맞춰서 반환, 객체단위로 입출력, 바이트 <==> 문자
 *  
 *  
 * 
 * 
 * 
 */
	}

}
