package memo;

public class Memo {

}


/*
 * 하드웨어
 * 
 * 발전 속도가 참 빠르다
 * 
 * 소프트웨어는
 * 
 * 그래서빠르게 발전하는 하드웨어 어디서든 유연하게 작동하게 만든다.
 * 
 * 소프트웨어 == 실체가 없음
 * 
 * 만든 걸 사는 게 아니라 만드는 능력을 산다.
 * 
 * 
 * 
 * 
 * 
 * 
 */






/*
*들으면서 혹은 갑자기 든 생각이나 의문
*나중에 찾아보거나 추가적으로 공부할 부분
*
*import는 project 가 달라도 되나
*
*int[] arr = {100, 200, 300, 400, 600};
*char[] love = new char[4];
*위에 처럼 쓰면 new 안써도 되나? 선언이랑 할당
*
* 근데 그러면 
 * System.out.println(nums[]);
 * 라고 해야 주솟값이 나와야하는 거 아닌가 왜
 * System.out.println(nums);
 * 라고 해야하는 거지
*
*참조 자료형 주소인데
*그러면 배열 안에 String 을 넣는 게 괜찮은건가
*
*식별자는 변수가 아닌가?
*
*배열이랑 객체생성 인스턴스화랑 뭐가 다르지
*
*변수랑 식별자는 뭐가 다른겨
*
*RAM 32G 정도는 되어야
*16G는 애매쓰
*
*
*
*/


/*
 * Data Base Management System
 * 조회정렬검색 특화
 * 
 * 1521 포트
 * ip 주소
 */




















