package com.kh.chap01.run;

public class Run {
	/*
	 * 
	 */
	//5:00 놓침
	
	// 내가 만든 프로그램을 기준으로 입출력이 정해짐
	
	//메모장에 적혀있는 오늘의 일기를 콘솔창에 출력해주는 코드 == 입력
	
	//콘솔창에 열심히 스캐너 가지고 문자열을 적어서 메모장에 저장 == 출력
}

/*나라		:		컴퓨터
 * 
 * 국민		:		응용소프트웨어(프로그램) -> O/S 위에 동작시킴. file(클라이언트 프로그램) 이라는 형태의 인터페이스를 사용함, 웹 개발자는 안만듦		
 * 				원래는 하드웨어까지 영향을 미치는 인터페이스가 존재해야하지만 //
 * 				JVM 만이 O/S 와 상호작용함 (다소 느림)				  //
 * 									
 * 	
 * 주권		:		운영체제(O/S) -> 인터페이스(명세)를 구현, 하드웨어 만드는 회사에 제공해서 이를 기반으로 만듦
 * 
 * 					인터페이스
 * 
 * 영토		:		하드웨어 -> 하드웨어 회사가 만드는 인터페이스를 드라이버라 함
 * 
 * 
 */
